cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71N21B.svd
            <register>
               <name>TXBRP</name>
               <description>Transmit Buffer Request Pending Register</description>
               <addressOffset>0xCC</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>TRP0</name>
                     <description>Transmission Request Pending for Buffer 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP1</name>
                     <description>Transmission Request Pending for Buffer 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP2</name>
                     <description>Transmission Request Pending for Buffer 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP3</name>
                     <description>Transmission Request Pending for Buffer 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP4</name>
                     <description>Transmission Request Pending for Buffer 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP5</name>
                     <description>Transmission Request Pending for Buffer 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP6</name>
                     <description>Transmission Request Pending for Buffer 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP7</name>
                     <description>Transmission Request Pending for Buffer 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP8</name>
                     <description>Transmission Request Pending for Buffer 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP9</name>
                     <description>Transmission Request Pending for Buffer 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP10</name>
                     <description>Transmission Request Pending for Buffer 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP11</name>
                     <description>Transmission Request Pending for Buffer 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP12</name>
                     <description>Transmission Request Pending for Buffer 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP13</name>
                     <description>Transmission Request Pending for Buffer 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP14</name>
                     <description>Transmission Request Pending for Buffer 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP15</name>
                     <description>Transmission Request Pending for Buffer 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP16</name>
                     <description>Transmission Request Pending for Buffer 16</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP17</name>
                     <description>Transmission Request Pending for Buffer 17</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP18</name>
                     <description>Transmission Request Pending for Buffer 18</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP19</name>
                     <description>Transmission Request Pending for Buffer 19</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP20</name>
                     <description>Transmission Request Pending for Buffer 20</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP21</name>
                     <description>Transmission Request Pending for Buffer 21</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP22</name>
                     <description>Transmission Request Pending for Buffer 22</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP23</name>
                     <description>Transmission Request Pending for Buffer 23</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP24</name>
                     <description>Transmission Request Pending for Buffer 24</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP25</name>
                     <description>Transmission Request Pending for Buffer 25</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP26</name>
                     <description>Transmission Request Pending for Buffer 26</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP27</name>
                     <description>Transmission Request Pending for Buffer 27</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP28</name>
                     <description>Transmission Request Pending for Buffer 28</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP29</name>
                     <description>Transmission Request Pending for Buffer 29</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP30</name>
                     <description>Transmission Request Pending for Buffer 30</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>TRP31</name>
                     <description>Transmission Request Pending for Buffer 31</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>TXBAR</name>
               <description>Transmit Buffer Add Request Register</description>
               <addressOffset>0xD0</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>AR0</name>
                     <description>Add Request for Transmit Buffer 0</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR1</name>
                     <description>Add Request for Transmit Buffer 1</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR2</name>
                     <description>Add Request for Transmit Buffer 2</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR3</name>
                     <description>Add Request for Transmit Buffer 3</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR4</name>
                     <description>Add Request for Transmit Buffer 4</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR5</name>
                     <description>Add Request for Transmit Buffer 5</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR6</name>
                     <description>Add Request for Transmit Buffer 6</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR7</name>
                     <description>Add Request for Transmit Buffer 7</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR8</name>
                     <description>Add Request for Transmit Buffer 8</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR9</name>
                     <description>Add Request for Transmit Buffer 9</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR10</name>
                     <description>Add Request for Transmit Buffer 10</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR11</name>
                     <description>Add Request for Transmit Buffer 11</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR12</name>
                     <description>Add Request for Transmit Buffer 12</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR13</name>
                     <description>Add Request for Transmit Buffer 13</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR14</name>
                     <description>Add Request for Transmit Buffer 14</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR15</name>
                     <description>Add Request for Transmit Buffer 15</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR16</name>
                     <description>Add Request for Transmit Buffer 16</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR17</name>
                     <description>Add Request for Transmit Buffer 17</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR18</name>
                     <description>Add Request for Transmit Buffer 18</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR19</name>
                     <description>Add Request for Transmit Buffer 19</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR20</name>
                     <description>Add Request for Transmit Buffer 20</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR21</name>
                     <description>Add Request for Transmit Buffer 21</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR22</name>
                     <description>Add Request for Transmit Buffer 22</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR23</name>
                     <description>Add Request for Transmit Buffer 23</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR24</name>
                     <description>Add Request for Transmit Buffer 24</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR25</name>
                     <description>Add Request for Transmit Buffer 25</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR26</name>
                     <description>Add Request for Transmit Buffer 26</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR27</name>
                     <description>Add Request for Transmit Buffer 27</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR28</name>
                     <description>Add Request for Transmit Buffer 28</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR29</name>
                     <description>Add Request for Transmit Buffer 29</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR30</name>
                     <description>Add Request for Transmit Buffer 30</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>AR31</name>
                     <description>Add Request for Transmit Buffer 31</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
