cmsis-svd/cmsis-svd/data/Atmel/ATSAMV71N21B.svd
            <register>
               <name>LOCKSR</name>
               <description>Lock Status</description>
               <addressOffset>0x00E0</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>P0</name>
                     <description>Lock Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P1</name>
                     <description>Lock Status</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P2</name>
                     <description>Lock Status</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P3</name>
                     <description>Lock Status</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P4</name>
                     <description>Lock Status</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P5</name>
                     <description>Lock Status</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P6</name>
                     <description>Lock Status</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P7</name>
                     <description>Lock Status</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P8</name>
                     <description>Lock Status</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P9</name>
                     <description>Lock Status</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P10</name>
                     <description>Lock Status</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P11</name>
                     <description>Lock Status</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P12</name>
                     <description>Lock Status</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P13</name>
                     <description>Lock Status</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P14</name>
                     <description>Lock Status</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P15</name>
                     <description>Lock Status</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P16</name>
                     <description>Lock Status</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P17</name>
                     <description>Lock Status</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P18</name>
                     <description>Lock Status</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P19</name>
                     <description>Lock Status</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P20</name>
                     <description>Lock Status</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P21</name>
                     <description>Lock Status</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P22</name>
                     <description>Lock Status</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P23</name>
                     <description>Lock Status</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P24</name>
                     <description>Lock Status</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P25</name>
                     <description>Lock Status</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P26</name>
                     <description>Lock Status</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P27</name>
                     <description>Lock Status</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P28</name>
                     <description>Lock Status</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P29</name>
                     <description>Lock Status</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P30</name>
                     <description>Lock Status</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>P31</name>
                     <description>Lock Status</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPMR</name>
               <description>Write Protection Mode Register</description>
               <addressOffset>0x00E4</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>WPEN</name>
                     <description>Write Protection Enable</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPKEY</name>
                     <description>Write Protection Key</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>24</bitWidth>
                     <enumeratedValues>
                        <name>WPKEYSelect</name>
                        <enumeratedValue>
                           <name>PASSWD</name>
                           <description>Writing any other value in this field aborts the write operation of the WPEN bit.Always reads as 0.</description>
                           <value>0x50494F</value>
                        </enumeratedValue>
                     </enumeratedValues>
                  </field>
               </fields>
            </register>
            <register>
               <name>WPSR</name>
               <description>Write Protection Status Register</description>
               <addressOffset>0x00E8</addressOffset>
               <size>32</size>
               <access>read-only</access>
               <fields>
                  <field>
                     <name>WPVS</name>
                     <description>Write Protection Violation Status</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>WPVSRC</name>
                     <description>Write Protection Violation Source</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>16</bitWidth>
                  </field>
               </fields>
            </register>
            <register>
               <name>SCHMITT</name>
               <description>Schmitt Trigger Register</description>
               <addressOffset>0x0100</addressOffset>
               <size>32</size>
               <fields>
                  <field>
                     <name>SCHMITT0</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>0</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT1</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>1</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT2</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>2</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT3</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>3</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT4</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>4</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT5</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>5</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT6</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>6</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT7</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>7</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT8</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>8</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT9</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>9</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT10</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>10</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT11</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>11</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT12</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>12</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT13</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>13</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT14</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>14</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT15</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>15</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT16</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>16</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT17</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>17</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT18</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>18</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT19</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>19</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT20</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>20</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT21</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>21</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT22</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>22</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT23</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>23</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT24</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>24</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT25</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>25</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT26</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>26</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT27</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>27</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT28</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>28</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT29</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>29</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT30</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>30</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
                  <field>
                     <name>SCHMITT31</name>
                     <description>Schmitt Trigger Control</description>
                     <bitOffset>31</bitOffset>
                     <bitWidth>1</bitWidth>
                  </field>
               </fields>
            </register>
